[
  {
  "id": "sms-gold-pawning",
  "name": "Shop Management System (SMS)",
  "shortDescription": "Comprehensive shop management system designed for gold pawning businesses with real-time transaction tracking and role-based access control.",
  "fullDescription": "A full-stack enterprise solution for gold pawning shops that streamlines inventory management, invoicing, loan processing, customer tracking, and financial reporting. The system features a modern Angular-based frontend with Material Design components and a robust .NET 8 Web API backend with Entity Framework Core for data persistence. Implements JWT authentication, automated background services for loan maintenance, and comprehensive reporting capabilities.",
  "technologies": [
    "Angular 18",
    ".NET 8",
    "Entity Framework Core 8",
    "SQL Server",
    "Angular Material",
    "Bootstrap",
    "Chart.js",
    "JWT Authentication",
    "AutoMapper",
    "Serilog",
    "RxJS",
    "Swagger"
    ],
  "role": "Full-Stack Developer",
  "thumbnailUrl": "",
  "screenshots": [],
  "challengesAndSolutions": [
    {
      "challenge": "Managing complex loan calculations with installment tracking across multiple karatage types while maintaining data consistency.",
      "solution": "Implemented repository pattern with Entity Framework Core for robust data access and transaction management, ensuring atomic operations for financial accuracy."
    },
    {
      "challenge": "Implementing secure role-based access control across multiple user types (Admin, Manager, Cashier) to protect sensitive financial data.",
      "solution": "Implemented JWT-based authentication with role claims for granular authorization, securing API endpoints and frontend routes based on user permissions."
    },
    {
      "challenge": "Handling large datasets for transaction history and inventory items efficiently without impacting performance.",
      "solution": "Developed a custom pagination service and utilized AutoMapper for optimized DTO transformations to ensure fast response times and reduced payload sizes."
    },
    {
      "challenge": "Automating loan status updates and interest calculations without manual intervention.",
      "solution": "Created background services using .NET hosted services to run scheduled maintenance tasks, ensuring loan statuses and interest are always up-to-date."
    },
    {
      "challenge": "Debugging complex transaction flows and monitoring system health in production.",
      "solution": "Integrated Serilog for comprehensive structured logging across all services, providing detailed insights into operations and facilitating quick issue resolution."
    },
    {
      "challenge": "The system faced significant risk of permanent data loss due to reliance on manual backup processes.",
      "solution": "Developed an automated backup service that regularly creates secure backups of the SQL Server database, ensuring data integrity and availability."
    }
  ],
  "githubUrlFE": "https://github.com/RanjuLG/SMS-GUI",
  "githubUrlBE": "https://github.com/RanjuLG/SMS-API",
  "liveUrl": ""
  }
]
